<a href="https://colab.research.google.com/github/sooonsyk/ESAA/blob/main/Week2_HW.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**파이썬 머신러닝 완벽 가이드 p. 39 ~ 86**

##데이터 핸들링 - 판다스
###판다스
- 행과 열로 이루어진 2차원 데이터를 효율적으로 가공/처리할 수 있는 기능 제공
- 파이썬의 리스트, 컬렉션, 넘파이 등의 내부 데이터뿐만 아니라 CSV등의 파일을 쉽게 Dataframe으로 변경해 데이터의 가공/분석을 편리하게 수행할 수 있게 만들어줌
- Dataframe : 판다스의 핵심 객체, 여러개의 행과 열로 이루어진 2차원 데이터를 담는 데이터 구조체
  - Index : 개별 데이터를 고유하게 식별하는 key
  - Series : 칼럼이 하나뿐인 데이터 구조체
  - Series와 Dataframe 모두 Index를 key 값으로 가짐
  - Dataframe은 여러개의 Series로 이루어졌다고 할 수 있음

###판다스 시작 - 파일을 DataFrame으로 로딩, 기본 API

```
import pandas as pd
```
- 판다스는 다양한 포맷으로 된 파일을 DataFrame으로 로딩할 수 있는 편리한 API 제공
  - read_csv() : CSV(칼럼을 ','으로 구분한 파일 포맷) 파일 포맷 변환을 위한 API
  - read_table() : 필드 구분 문자(delimeter)가 '\t'
  - read_fwf() : fixed width 즉 고정 길이 기반의 칼럼 포맷을 위한 API
  - 구분문자는 sep 옵션을 통해 설정 가능
  - 로드하려는 데이터 파일의 경로를 포함하는 파일명을 입력하면 파이썬 실행 파일이 있는 디렉터리와 동일한 디렉터리에 있는 파일명을 로딩함

In [ ]:
import pandas as pd

In [6]:
titanic_df = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/train.csv')
print('titanic 변수 type : ', type(titanic_df))
titanic_df

titanic 변수 type :  <class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

- pd.read_csv() : 호출 시 파일명 인자로 들어온 파일을 로딩해 DataFrame 객체로 반환
  - 별다른 파라미터 지정이 없으면 파일의 맨 처음 로우를 칼럼명으로 인지하고 칼럼으로 변환함
  - 파일에 기재돼 잇지 않는 데이터값이 로우 순으로 0,1,2,3....과 같이 순차적으로 표시돼 있음 - 판다스의 index 값
    - 모든 DataFrame내의 데이터는 생성되는 순간 고유의 Index값을 가짐

- DataFrame.head() : DataFrame의 맨 앞에 잇는 N개의 로우 반환, default 5개

In [8]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

- DataFrame.shape : DataFrame의 행과 열의 튜플로 반환

In [9]:
print('DataFrame 크기 : ', titanic_df.shape)

DataFrame 크기 :  (891, 12)

- DataFrame.info() : 총 데이터 건수와 데이터 타입, Null 건 수 알 수 있음

In [10]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

- DataFrame.describe() : 칼럼별 숫자형 데이터값의 n-percentile 분포도, 평균값, 최댓값, 최솟값을 나타냄, 오직 숫자형(int,float 등) 칼럼의 분포도만 조사하며 자동으로 object 타입의 칼럼은 출력에서 제외시킴
  - count : not null인 데이터 건수
  - mean : 전체 데이터 값의 평균
  - std : 표준편차
  - min : 최솟값
  - max : 최댓값
  - 해당 숫자 칼럼이 숫자형 카테고리 칼럼(특정 번주에 속하는 값을 코드화한 칼럼)인지를 판단할 수 있게 도와줌

In [11]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

- DataFrame의 [ ] 연산자 내부에 칼럼며을 입력하면 Series 형태로 특정 칼럼 데이터 세트가 반환됨
- Series : Index와 단 하나의 칼럼으로 구성된 데이터 세트
- value_counts() : 이렇게 반환된 Series 객체에 호출하면 해당 칼럼값의 유형과 건수를 확인할 수 있음, 지정된 칼럼의 데이터값 건수 반환
  - 많은 건수 순서로 정렬되어 값을 반환
  - DataFrame은 가지지 않음
  - 반환하는 값 역시 Series 객체
- 인덱스는 단순히 순차 값과 같은 의미 없는 식별자만 할당하는 것이 아니라 고유성이 보장된다면 의미 있는 데이터값 할당도 가능
  - value_counts()는 칼럼 값별 데이터 건수를 반환하므로 고유 칼럼 값을 식별자로 사용할 수 있음
  - 인덱스는 후에 변경 가능, 숫자형뿐만 아니라 문자열도 가능, 단, 모든 인덱스는 고유성이 보장돼야 함

In [16]:
titanic_pclass = titanic_df['Pclass']
type(titanic_pclass)

pandas.core.series.Series

In [13]:
titanic_df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [17]:
titanic_pclass.head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [18]:
type(titanic_pclass.value_counts())

pandas.core.series.Series

###DataFrame과 리스트, 딕셔너리, 넘파이 ndarray 상호 변환
- 기본적으로 DataFrame은 파이썬의 리스트, 딕셔너리, 그리고 넘파이 ndarray등 다양한 데이터로부터 생성될 수 있음, 또 반대로 변환될 수도 있음
####**넘파이 ndarray, 리스트, 딕셔너리를 DataFrame으로 변환하기**
- DataFrame은 리스트와 넘파이 ndarray와 다르게 칼럼명을 가지므로 리스트와 넘파이 ndarray보다 상대적으로 편하게 데이터 핸들링 가능
  - 일반적으로 DataFrame으로 변환 시 칼럼명을 지정해줌( 지정하지 않으면 자동으로 할당)
- 판다스 DataFrame 객체의 생성 인자 data는 리스트나 딕셔너리 또는 넘파이 ndarray를 입력 받고, 생성 인자 colums는 칼럼명 리스트를 입력 받아 DataFrame 생성
  - DataFrame은 기본적으로 행과 열을 가지는 2차원 데이터 이므로 2차원 이하의 데이터들만 DataFrame으로 변환될 수 있음

In [19]:
#1차원 형태의 list, 넘파이 ndarray 변환
import numpy as np

col_name1 = ['col1']
list1 = [1,2,3]
array1 = np.array(list1)
print('array1 shape : ', array1.shape)

#리스트 이용해 DataFrame 생성
df_list1 = pd.DataFrame(list1, columns = col_name1)
print('1차원 리스트로 만든 DataFrame : \n', df_list1)

#넘파이 ndarray 이용해 DataFrame 생성
df_array1 = pd.DataFrame(array1, columns = col_name1)
print('1차원 ndarray로 만든 DataFrame :\n', df_array1)

array1 shape :  (3,)
1차원 리스트로 만든 DataFrame :
    col1
0     1
1     2
2     3
1차원 ndarray로 만든 DataFrame :
    col1
0     1
1     2
2     3

In [20]:
#2차원 형태(2,3)의 데이터 변환

col_name2 = ['col1','col2','col3'] # 칼럼 3개니까 칼럼명 3개 필요
list2 = [[1,2,3],
         [11,12,13]]
array2 = np.array(list2)
print('array2 shape : ', array2.shape)
df_list2 = pd.DataFrame(list2, columns = col_name2)
print('2차원 리스트로 만든 DataFrame:\n', df_list2)
df_array2 = pd.DataFrame(array2, columns = col_name2)
print('2차원 ndarray로 만든 DataFrame:\n', df_array2)

array2 shape :  (2, 3)
2차원 리스트로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13
2차원 ndarray로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13

In [21]:
#딕셔너리 변환 : 일반적으로 key를 칼럼명으로 value를 키에 해당하는 칼럼 데이터로

dict = {'col1':[1,11], 'col2':[2,22], 'col3':[3,33]}
df_dict = pd.DataFrame(dict)
print('딕셔너리로 만든 DataFrame:\n', df_dict)

딕셔너리로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    22    33

####**DataFrame을 넘파이 ndarray, 리스트, 딕셔너리로 변환하기**

In [ ]:
#D